const $content = document.querySelector('.content');

const FOODS = [
    {
        name:'炒面条',
        ingredients:['1.2元的圆面','菜椒','蒜苔','鸡蛋','肉丝'],
        steps:`
            <p>面的处理：1.2元的圆面煮变软，然后过凉水，之后放入少许的盐，鸡精，生抽，老抽，十三香少许，搅拌</p>
            <p>如果炒鸡蛋的话：一个不辣的菜椒，蒜苔切段，3个鸡蛋。放油下鸡蛋，捞出，再少许油放菜椒，放蒜苔，炒一会之后放生抽，放鸡精，放少许盐，少许醋，期间放少许水，炒个3-5分钟之后把面放进去快速搅拌1分钟就好了。</p>
            <p>如果要炒肉的话：6块钱的肉放生抽，老抽，料酒，少许胡椒粉，少许盐，少许玉米淀粉，搅拌均匀腌制。</p>
        `
    },
    {
        name:'酸辣粉',
        color:'red',
        ingredients:['豆泡','2元海带','1张豆腐皮','两包土豆粉','花生脆','鹌鹑蛋','香菜','葱花'],
        steps:`
            <p>调料：蒜泥，芝麻，小葱花，辣椒面，放热油婆一下，之后放一勺生抽，半勺老抽，半勺糖，2勺醋，少许五香粉，少许十三香，少许盐，再放半碗白开水，</p>
            <p>做法：全部食材水开之后放进去煮熟，土豆粉最后放进去煮2分钟就行，捞出，放调料，花生脆，香菜，搅拌</p>
        `
    },
    {  
        name:'黄焖鸡',
        color:'red',
        ingredients:['整只鸡切块','香菇','菜椒','土豆'],
        steps:`
            <p>提前准备：1、香菇洗干净泡水。2、鸡块洗干净之后放配料：生抽，老抽，料酒，白胡椒粉，生姜片，蚝油，五香粉腌制。3、土豆切好之后洗下淀粉</p>
            <p>做法：锅中热油，放土豆块，变色之后捞出备用。热油，放入冰糖，炒糖色（小火慢慢化开，大火容易苦），放入鸡块，大火翻炒上色之后，再放入姜片，香叶，蒜瓣，炒一会之后，放料酒，蚝油，生抽，白胡椒粉，老抽，冰糖，翻炒一会，放入香菇，并把香菇泡的水倒进去，一定要过鸡块的水，大火烧开之后去浮沫，转中小火30分钟后，放入土豆块10分钟，转大火收汁，放入鸡精，菜椒，煮3分钟就行</p>
        `
    },
    {
        name:'红烧肉',
        ingredients:['五花肉','葱段'],
        steps:`
            <p>提前准备：红烧肉切块洗干净之后，撩水，之后洗干净弄干。鸡蛋煮几个</p>
            <p>做法：热油，放入葱段，姜片，爆香之后放入五花肉翻炒出香味，放料酒，生抽，老抽，老冰糖，加入没过肉的温水，放鸡蛋，大火烧开，之后转中小火40分钟，中间翻炒几次，之后大火收汁</p>
        `
    },
    {
        name:'牛肉炒饭',
        color:'red',
        ingredients:['20元牛肉粒','胡萝卜','菜椒','葱花'],
        steps:`
            <p>提前准备：牛肉粒放1勺蚝油，1勺料酒，1勺生抽，2快姜片，白胡椒粉，五香粉，少许淀粉</p>
            <p>做法：热油，放牛肉粒翻炒一会之后放胡萝卜粒，菜椒粒，翻炒1分钟之后，放入米饭，少许生抽，鸡精，炒个3分钟后，放葱花</p>
        `
    },
    {
        name:'炝锅面',
        ingredients:['1.2元的圆面','菜椒','豆芽','海带'],
        steps:`
            <p>提前准备：肉放生抽，老抽，料酒，白胡椒粉，少许淀粉</p>
            <p>做法：热油，放肉，放五香粉，炒差不多之后放菜椒，豆芽，海带，放入开水，水开之后放入面条，差不多只有放鸡精，香油</p>
        `
    },
    {
        name:'阳春面',
        color:'red',
        ingredients:['龙须面'],
        steps:`
            <p>汤底：葱花，猪油（芝麻油），生抽，少许糖，鸡精，醋,白胡椒，然后热油倒进去激发香味，加几勺开水或者面汤</p>
            <p>做法：开水加少量盐煮面，直接放入汤底中，可以加一个鸡蛋</p>
            <p>加肉：肉丝加少许油，胡椒粉，淀粉，腌制，杏蘑菇切丝，热锅，凉油，下肉丝，炒到变色，盛出，之后加油，放蒜泥，放杏蘑菇到变软出水，把肉丝放进去，放一勺生抽，半勺老抽，一勺蚝油，快速翻炒之后放菜椒丝，放鸡精，盛出</p>
        `
    },
    {
        name:'辣椒炒肉<br>《一碗香》',
        color:'red',
        ingredients:['螺丝椒','豆豉','肉片','小米辣'],
        steps:`
            <p>做法：先炒鸡蛋（可以加少量的米醋）盛出，锅中不放油，直接放螺丝椒，少许盐，煸香之后盛出，锅中放油，放肉片，出油变色之后就可以放豆豉，蒜，小米辣，放螺丝椒，炒一下之后放，生抽，老抽，白胡椒粉，香油，之后放鸡蛋，之后再放一点料酒，大火出锅</p>
        `
    },
    {
        name:'营养粥',
        ingredients:['各种豆'],
        steps:`
            <p>五红汤：枸杞，红豆，红枣，花生，红糖，（薏米，紫薯）</p>
            <p>养发粥：糯米，红枣，黑米，黑芝麻，花生，黑豆</p>
            <p>营养粥：红豆，花生，莲子，红米，黑米，红枣，枸杞</p>
        `
    }
]

class Food {
    constructor() {
    }
    updataHtml() {
        const $table = document.createElement('table');
        $table.className = 'el-table';
        $table.style.maxWidth = '100vw';
        $table.innerHTML = `
            <thead>
                <tr>
                    <th>序号</th>
                    <th>菜名</th>
                    <th>食材</th>
                    <th>做法</th>
                </tr>
            </thead>
            <tbody></tbody>
        `;
        const $tbody = $table.querySelector('tbody');
        FOODS.forEach((food, index) => {
            const tr = document.createElement('tr');
            tr.innerHTML = `
                <td class="f-tac">${index + 1}</td>
                <td style="color:${food.color || 'inherit'};">${food.name}</td>
                <td style="white-space: normal;">${food.ingredients.join('，')}</td>
                <td style="white-space: normal;">${food.steps}</td>
            `;
            $tbody.appendChild(tr);
        })
        $content.appendChild($table);
    }
}
const food = new Food();
food.updataHtml();